[
  {
    "id": 1,
    "name": "Adv AV Eng/TV Studio",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "Students who excel in Advanced AV 1 and wish to continue their video production education can elect to take Advanced A/V 2 and Advanced A/V 3.  These courses are combined into one class period, so the class is made up of a mixture of juniors and seniors.  The major project in both Advanced AV 2 & 3 is the production of “The SIT Down,” a bi-weekly news program made for the entire school community.  “The SIT Down” combines both studio and mobile production at a very technically complex level.   The program is a collaboration of the entire class, with Advanced 2 students serving on the general crew positions and Advanced 3 taking on the more leadership-oriented producer roles.  This demanding undertaking will draw on all the skills and talents that students have developed in Intro to A/V and Advanced A/V Engineering 1, as they will now be the engineers utilizing the technology in the school’s professional-grade television studio.  Other projects throughout these courses include a short film, a public service announcement, multiple news story field packages, as well as an opportunity to serve on the crew of various productions for the school community as needed throughout the year.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["AKS41TFP"]
  },
  {
    "id": 2,
    "name": "Adv AV Eng/TV Studio 2",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["AKS43TFP"]
  },
  {
    "id": 3,
    "name": "Adv AV Eng/TV Studio 3",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "ARTS",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["AKS65TFP"]
  },
  {
    "id": 4,
    "name": "Design & Fabrication",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "Design and Fabrication (D&F) is a full-year elective open to grades 10-12, that takes place in the SITHS Makerspace. The Makerspace is fully equipped with fine art materials, tools, and machinery including a CNC router, and a Plasma Table. The ideal student is one interested in fine arts, fabrication, technology, and engineering. This class will build upon the skills students may already have and develop new ones. Students will have the opportunity to design and develop their own passion projects. \\n In addition to developing their own projects, throughout the year students will assist their peers in the Makerspace as apprentices. Subject teachers will bring down their classes for project-based learning (PBL) assignments at which time D&F students will assist them with safety, developing their projects, painting, sculpture, woodworking, and using machinery/tools, among other things. \\n The following topics and skills will be covered but are not limited to: \\n Painting \\n Sculpture \\n Woodworking \\n Fabrication \\n Product Design and Development \\n In addition to the skills listed above, students will learn career and life skills such as time management, interpersonal communication, community projects, and collaboration as they work with their peers to produce all of these projects.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["AQS21T"]
  },
  {
    "id": 5,
    "name": "CAD/Civil Eng/Arc - CSI 2778",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["ARS21T"]
  },
  {
    "id": 6,
    "name": "Adv CAD/Civil Eng/Architecture",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "In order to take Advanced CAD you must have completed our first CAD class in good standing and complete an application. On it you speak about your reasons to take the course and do a short independent CAD exercise. The purpose of Advanced CAD is to choose a career driven specialty area and develop a professional level portfolio to use when applying for college, internships, and a job. \\n Advanced CAD allows you to have a specialized track to develop a portfolio that represents you perfectly. There will be multiple sections of the course offered that now offer more options than ever before. Please understand there are now two different versions of the class to register for, with one of them offering further pathway selection as explained below. \\n In our 3D modeling course section you will specialize in a career path using Autodesk products of your choice based on the career path. You will use primarily Revit, Inventor, or Blender / 3DS Max. Supplementally you may use Fusion 360, Rhino, AutoCAD, FormIt, SketchUp, TinkerCAD or others that allow 3D modeling. Upon entering this section you will then choose a career path to study 3D modeling, which will lead to you using Revit, Inventor, or Blender / 3DS Max. Finishing tools such as 3D printers, laser engravers, and other hardware will be available to create physical models. \\n We also have an Adobe Graphics course section in which you will use Photoshop, Illustrator, and supporting Adobe products to learn how to create graphics for print and digital publishing, covering all career paths that make use of these skills. The nature of this work will occur in two-dimensional design.  The Adobe 2D Graphics programs are Photoshop, Illustrator, InDesign, and other supporting products that focus on combining knowledge of vector and raster graphics and using them at a professional level for industry related goals and portfolio creation. \\n Unlike the first CAD class at SI Tech, in Advanced CAD there are very few demonstrations that come from the instructor's thoughts. This is due to the students working on their OWN INDEPENDENT TRACK of projects in one of the programs above. If the tracks do not fit the student, then they and the instructor can craft a new track that still uses one of the main CAD software experiences. During the course of the year students regularly conference with the instructor, who grades them based on progress that is positive and timely, based on their status during the previous conference. Grades are NOT from completed projects because projects will vary wildly in scale for each student. During project design, the students are required to maintain a LIVE design document that is shared with the instructor. This is where communication takes place in between conferences and notes are added during conferences. The contents of this LIVE document will evolve into being a narrative of the student's work complete with pictures and other media into an online portfolio where the students can speak to their design process with precision because of the documentation. \\n There is NO homework other than the students desires to research for their projects and prepare resources. There are no exams and no required certifications, however students are encouraged strongly to take more User level Certiport exams in their field (Revit, Inventor, Max) and urged to consider taking the Professional tier exam for a greatly reduced fee due to a special coupon our students are granted access to when they are active in Staten Island Tech. Exams in Adobe products and others will also be considered to be offered. \\n Make no mistake, this is an elective class meant for students to learn CAD to a degree typically deeper than that of a working professional. Expectations are high and history speaks loudly for those who take the course. An amazing career awaits your appetite for design. For more information contact Mr. Buro, Ms. Geraghty, or Ms. Barone in school or via email. \\n Below are more details about the areas of focus and associated CAD program built for the industry that is chosen. All students should have knowledge of AutoCAD usage and probably have experienced one or two others in regular CAD or Principles of Engineering. The 3D Design programs are Revit, Inventor Professional, and Blender/3DS Max. Below you can look at popular examples of those specialty areas. Green Architecture, Biomedical Engineering, and 3D Modeling in Media. Other examples include Mechanical Eng, Automotive Eng, Aerospace Eng, CGI Special Effects, or really any other career that has a CAD as a foundational tool.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["ARS21TA"]
  },
  {
    "id": 7,
    "name": "Theater Arts",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "ARTS",
    "description": "Theater Production (Grade 11/12) -  The Theatre Production elective class offers the opportunity for students to gain the confidence to perform in front of their peers and the knowledge of what goes on behind the scenes. Students will become well-versed in the roles within a theatre company, influential movie directors, the history of television, the Golden Age of Hollywood and broadway musicals, amongst other topics. The class studies and discusses the impact of performing arts on our society and culture both today and in the past. These units will be interspersed with performance opportunities such as monologues, scene study, improvisation, staged readings, and ballroom dancing. No prior experience is necessary to enroll in this class and your grade is determined not by your level of talent but rather your desire to learn and the effort put forth.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["CBS21"]
  },
  {
    "id": 8,
    "name": "AP Eng Language",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "ENGLISH",
    "description": "The Advanced Placement Language and Composition class is a full year section that will take a detailed look at the art of writing and rhetoric.  Through both fictional and non-fictional works students will gain a deeper understanding of HOW a work is constructed in order to shape the author’s meaning and purpose through style, strategy, and technique.  Students will be exposed to a challenging list of essays, speeches, fictional and non-fictional prose.  In addition, sporadic AP questioning and peer review will help to develop confidence and sharpen skills for the Language and Composition Exam.  Although students will be exposed to the American Literature curriculum for high school junior, this class will not follow the patterns and timelines of other non-AP courses. \\n As always, and in keeping with the College Board, AP Course Description, the goal of this class will be to help students “write effectively and confidently in their college courses across the curriculum and in their professional and personal lives” (2005 – 2006 Workshop Materials 49).  Students will be expected to respond to various texts in writing concerning theme, as well as purpose and rhetorical mode.  In addition, each student will prepare analytical essays in which they synthesize materials reviewed and course information gained from lecture and class discussion.  Critical reading skills along with the processes of synthesis, research, writing, and revision will be emphasized. \\n At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES21X5"]
  },
  {
    "id": 9,
    "name": "AP Eng Literature",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "ENGLISH",
    "description": "Advanced Placement Literature and Composition is a class of close and deep reading, with a strong focus on the tools and application of author’s craft. A central and recurring question drives nearly all aspects of class analysis and discussion, of writing tasks small and formal: How and why does (author’s name) use of (literary device and/or technique) contribute to the meaning of the literary work? \\n Its satisfactory response requires students to strengthen their ability to recognize, understand and articulate (through inevitably eloquent writing) how and why an author uses specific tools, and to what effect. This skill is attained through the guided close reading and analysis of poetry, prose and drama from various time periods. Students will learn to recognize the role of subtext, structure, literary elements, and the social dynamics of the time on the meaning and message of a given work of fiction-- that is, the large and timeless truths of humanity. Advanced Placement Literature and Composition students emerge from the course as sharp writers with a thoughtful, insightful and instinctive ability to evaluate fiction --an invaluable tool that is applicable to all areas of study.  At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES21X7"]
  },
  {
    "id": 10,
    "name": "English",
    "freshman": true,
    "sophomore": false,
    "junior": false,
    "senior": false,
    "subject": "ENGLISH",
    "description": "All 9th graders take a one-term Intensive Writing Program, focusing on English Rhetoric and Communication skills that transcend the classroom and become effective, practical and required tools in the real-world, the alternate term compliments the Writing Program with Literature and Language Arts skills to build readers and craft writers using multiple genres including but not limited to Shakespearean literature, Greek Mythology, graphic novels . \\n The initial steps examine the ancient meaning of journey. Students will read literature that spans Greek and Roman history, from mythical monsters to modern science fiction, interpreting and defining the archetype of the hero and the hero’s journey.  As students consider the plight of ordinary and epic characters, they will respond to their trials, their tests, and their human and heroic qualities incorporating the lessons taught to us into their own trials and tests of the adventure called high school. This course is designed to help students improve skills in critical reading and critical thinking. The course will also focus on the craft of composition and skills required for the SAT examination, the English Common Core Regents and writing products that meet the ELA Common Core State Standards.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES81H"]
  },
  {
    "id": 11,
    "name": "English Writing",
    "freshman": true,
    "sophomore": false,
    "junior": false,
    "senior": false,
    "subject": "ENGLISH",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES81HW"]
  },
  {
    "id": 12,
    "name": "English 2",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "ENGLISH",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES83H"]
  },
  {
    "id": 13,
    "name": "English 3",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "ENGLISH",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES85H"]
  },
  {
    "id": 14,
    "name": "E7 Dramatic Literature",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "ENGLISH",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES87HDL"]
  },
  {
    "id": 15,
    "name": "E7 Publications",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "ENGLISH",
    "description": "In this course, students will gain skills in one or more of the following areas: page design, advanced publishing techniques, copywriting, editing and photography, caption writing and more! This course is deadline driven but also allows for the creative freedom you may be looking for during your senior year. It is a different class experience that relies heavily on completing personal/team projects (such as a podcast, running the Student Life social media account, event scrapbook, or the publication of the Yearbook, etc.). There is also an extracurricular component to the class because you can focus on being a publications photographer to fulfill your assignments. Participants gain useful, real-world skills in time management, marketing, teamwork, and design principles.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES87HEJ"]
  },
  {
    "id": 16,
    "name": "E7 Public Speaking",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "ENGLISH",
    "description": "This course prepares students for a variety of academic, social, and professional situations in which formal presentations are required in addition to traditional writing skills. Topics will include theories and practices about speech communication, verbal and nonverbal messages, and techniques of oral presentation and persuasion. Students will learn research, outline, and delivery skills for presentations using powerpoint, prezi, and stand-alone speech. The public speaking class is designed to provide opportunities for students to develop and strengthen their skills in preparing and presenting oral presentations in a variety of situations.  Although some students might find the emphasis on performance frightening or frustrating, the rewards for acquiring public speaking skills are many. Through feedback, support, and guidance, students will gain insight into the tactics that will help them become more effective speakers.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES87HPS"]
  },
  {
    "id": 17,
    "name": "E7 Creative Writing - SJU 2799",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "ENGLISH",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EES87UCW"]
  },
  {
    "id": 18,
    "name": "Theater Arts Kingsboro 2358",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "ENGLISH",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["EQS11UCN"]
  },
  {
    "id": 19,
    "name": "Russian in Business",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "LANG",
    "description": "In 2016/2017 Staten Island Technical High School was honored to partner with the Pushkin State Russian Language Institute in Moscow, Russia, a renowned institution of higher learning.  Staten Island Technical High School is one of only 30 hub sites worldwide to spread knowledge of the Russian Language beginning with our Russian for Business Elective Course offered for seniors based on the Pushkin State Russian Language Institute Curriculum.  Students in this class speak in Russian to learn to communicate in the business world to study international relations and prepare themselves to assimilate to Russian cultures and the world of economics and partnership.  Students use project based learning to delve into the world of business using Russian Company profiles, Reports for each business quarter, and to communicate with local businesses and business owners.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["FRS21HB"]
  },
  {
    "id": 20,
    "name": "College Russian - U Albany 2532",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "LANG",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["FRS21U"]
  },
  {
    "id": 21,
    "name": "College Russian Heritage-StonyBr2548",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "LANG",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["FRS21UH"]
  },
  {
    "id": 22,
    "name": "Russian",
    "freshman": true,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "LANG",
    "description": "Until the fall of 2018, ninth grade students were placed in homogeneous groups consisting of both heritage and non-heritage speakers, respectively, based upon an entrance interview, and short written evaluation. Students are now grouped heterogeneously for the Spring term of ninth grade, with a strong focus on grammatical skills, reading comprehension, and writing, and assessed periodically using the Can Do Statements & World-Readiness Standards for Learning Languages to determine language levels.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["FRS61H"]
  },
  {
    "id": 23,
    "name": "Russian 2",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": false,
    "subject": "LANG",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["FRS63H"]
  },
  {
    "id": 24,
    "name": "Advanced Russian 2",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": false,
    "subject": "LANG",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["FRS63HA1"]
  },
  {
    "id": 25,
    "name": "Adv Heritage Russian 2",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "LANG",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["FRS63HA2"]
  },
  {
    "id": 26,
    "name": "Russian 3",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "LANG",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["FRS65H"]
  },
  {
    "id": 27,
    "name": "Service to School",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "OTHER",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["GLS11"]
  },
  {
    "id": 28,
    "name": "Learning Lab",
    "freshman": true,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "OTHER",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["GMS11"]
  },
  {
    "id": 29,
    "name": "First Year Seminar - CSI 2778",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "OTHER",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["GQS11UCN"]
  },
  {
    "id": 30,
    "name": "Behav Soc Sci - Kingsboro 2358",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SS",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HBS11UCN"]
  },
  {
    "id": 31,
    "name": "Economics",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "SS",
    "description": "Term 1 of American Government & Economics explores the structure, dynamics and processes of the American system of government, providing a comprehensive introduction to the origins and development of ideas and institutions that influence the contemporary political milieu. The course examines the development and composition of the Declaration of Independence, the United States Constitution, the three branches of government, political parties, and interest groups within the framework of the historical, economic and social context.  Term 2 of this course explores 95% personal finance and a broad overview of the fundamental economic question of the behavior of consumers, firms, and markets under the constrictions of scarcity. Topics covered weigh heavily on personal finance and making healthy financial choices.  Some topics also covered include supply and demand analysis, determination of market prices, profit maximizing output, distribution of income, Gross Domestic Product, and fiscal and monetary policy.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HES11H"]
  },
  {
    "id": 32,
    "name": "AP Macroeconomics",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "SS",
    "description": "https://apstudent.collegeboard.org/apcourse/ap-macroeconomics \\n Macroeconomics studies the business cycle, national income, productivity, employment, trade, price levels, growth, and stabilization policies as parts of an interactive economic arrangement. Students study models that describe how a market economy works as a system. Macroeconomics has considerable value in helping make effective decisions about educational and career choices, personal finance, and the economic implications of government policies. \\n Goals and Objectives: The goal is to learn the vocabulary, concepts and graphical models of the principles of macroeconomics. The main objective is to master the conceptual and graphical skills within each of the five instructional units. This involves applying concepts acquired in lectures and readings to problems of macroeconomic description, translation, interpretation, and analysis.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HFS21XM"]
  },
  {
    "id": 33,
    "name": "AP US Gov & Politics",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "SS",
    "description": "https://apstudent.collegeboard.org/apcourse/ap-united-states-government-and-politics",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HFS21XPS"]
  },
  {
    "id": 34,
    "name": "AP World History",
    "freshman": true,
    "sophomore": false,
    "junior": false,
    "senior": false,
    "subject": "SS",
    "description": "AP World History is designed to be the equivalent of a two-semester introductory college or university world history course. In AP World History students investigate significant events, individuals, developments, and processes in six historical periods from approximately 8000 B.C.E. to the present. Students develop and use the same skills, practices, and methods employed by historians: analyzing primary and secondary sources; developing historical arguments; making historical comparisons; and utilizing reasoning about contextualization, causation, and continuity and change over time. The course provides five themes that students explore throughout the course in order to make connections among historical developments in different times and places: interaction between humans and the environment; development and interaction of cultures; state building, expansion, and conflict; creation, expansion, and interaction of economic systems; and development and transformation of social structures.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HGS41X"]
  },
  {
    "id": 35,
    "name": "AP World History 2",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "SS",
    "description": "",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HGS43X"]
  },
  {
    "id": 36,
    "name": "Women in History - Kingsboro 2358",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "SS",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HRS11UCN"]
  },
  {
    "id": 37,
    "name": "AP US History",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "SS",
    "description": "In AP U.S. History, students investigate significant events, individuals, developments, and processes from approximately 1491 to the present. Students develop and use the same skills and methods employed by historians: analyzing primary and secondary sources; developing historical arguments; making historical connections; and utilizing reasoning about comparison, causation, and continuity and change. The course also provides eight themes that students explore throughout the course in order to make connections among historical developments in different times and places: American and national identity; work, exchange, and technology; geography and the environment; migration and settlement; politics and power; America in the world; American and regional culture; and social structures. \\n Time in class will be devoted to testing preparation for the two mandatory culminating exams. \\n Nightly homework and standardized test-style exams will be used alongside project and engagement-based assessments.  ",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HUS21X"]
  },
  {
    "id": 38,
    "name": "AP US History Arts",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "SS",
    "description": "Students will learn the story of the United States and her cultural development through the mediums of film, artwork, and music. Student discussions will focus on how these various forms can serve various purposes - as a Factual Record, to Convey Atmosphere, as an Analogy, and as a lesson in Historiography. Because the dramatic form used in art requires consistent and relatively simple motivational interpretations, students can often learn how the time period in which the film was made interpreted historical personalities and events. Culturally responsive selections will expand students’ understanding of their own culture as well as the many cultures in the story of the United States. Each foundational piece of artwork for a particular unit will comprise three levels of investigation and analysis. The first level will be researching the contextualization of the art: When was it created, what period is it meant to reflect, and how is the creator’s own experiences reflected in the product. Such analysis is similar to the HIPP analysis done by history students in Staten Island Tech in the AP World course from 9th and 10th grade. The second level will be viewing/listening to the source material, requiring engaging class discussion and debate on the messages, emotions, and stories conveyed through the art. The third and final level will be a synthesis and demonstration of learning, where students will combine their research with their experience with the source and complete either film reviews, research papers, debates, or other projects that demonstrate student mastery of skills woven throughout the course. \\n Important considerations:  In the New US Course, US History through Film, Art, and Music, students must be eager to take this course based on the subject content and artistic lens, not for test prep or a full preparation for the AP exam or Regent Exam.  While students will learn and use skills and content needed for the AP exam in the class, this course may be more ideal for students who passed the regent exam already since test prep will not be a focus in class. Students MUST UNDERSTAND that they will still be taking the AP exam and NY Regent Exam (if not passed prior).  The course content will cover the entire time period of US History, however there will be deeper exploration of particular themes and topics at the expense of covering the full breadth of the usual US History course.   \\n While nightly homework will be most likely be minimal, long-term projects, thematic assignments, and research papers, as well as vigorous participation-based assessments (ie: debates, etc) will be the method of assessment. Packets and resources to prepare students for the AP exam will be provided, but students will take responsibility to do the assigned test prep materials asynchronously. A student who is good at independent scheduling and has a self-motivated work ethic is ideal for this course.  ",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HUS21XA"]
  },
  {
    "id": 39,
    "name": "Participation in Government",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "SS",
    "description": "Term 1 of American Government & Economics explores the structure, dynamics and processes of the American system of government, providing a comprehensive introduction to the origins and development of ideas and institutions that influence the contemporary political milieu. The course examines the development and composition of the Declaration of Independence, the United States Constitution, the three branches of government, political parties, and interest groups within the framework of the historical, economic and social context.  Term 2 of this course explores 95% personal finance and a broad overview of the fundamental economic question of the behavior of consumers, firms, and markets under the constrictions of scarcity. Topics covered weigh heavily on personal finance and making healthy financial choices.  Some topics also covered include supply and demand analysis, determination of market prices, profit maximizing output, distribution of income, Gross Domestic Product, and fiscal and monetary policy.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["HVS11H"]
  },
  {
    "id": 40,
    "name": "Multivariable Calculus",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "MATH",
    "description": "In this course, students will extend what was learned in Advanced Placement Calculus BC and learn about the subtleties, applications, and beauty of limits, continuity, differentiation, and integration in higher dimensions. This course covers vector and multivariable calculus. Topics include vectors in Euclidean space, vector analysis, analytic geometry of three dimensions, curves in space, partial derivatives, optimization techniques, multiple integrals, line integrals and surface integrals, vector fields, Green’s theorem, Divergence theorem and Stokes’ theorem.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MCS21C"]
  },
  {
    "id": 41,
    "name": "Calculus",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "MATH",
    "description": "The goal of this class is to give students who did not qualify to take the Advanced Placement Calculus Course, a 'taste' of Calculus.  The course will better prepare students for Calculus 1 and 2 in college.  The class follows the same outline as AP Calculus AB, but it moves at a slower pace. \\n Course Objectives \\n Students should be able to work with functions represented in a variety of ways: graphical, numerical, analytic, or verbal. They should understand the connections among these representations. \\n Students should understand the meaning of the derivative in terms of a rate of change and local linear approximation, and should be able to use derivatives to solve a variety of problems. \\n Students should understand the meaning of the definite integral both as a limit of Riemann sums and as the net accumulation of change, and should be able to use integrals to solve a variety of problems. \\n Students should understand the relationship between the derivative and the definite integral as expressed in both parts of the Fundamental Theorem of Calculus. \\n Students should be able to communicate mathematics and explain solutions to problems both verbally and in written sentences. \\n Students should be able to model a written description of a physical situation with a function, a differential equation, or an integral. \\n Students should be able to use technology to help solve problems, experiment, interpret results, and support conclusions. \\n Students should be able to determine the reasonableness of solutions, including sign, size, relative accuracy, and units of measurement. \\n Students should develop an appreciation of calculus.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MCS21H"]
  },
  {
    "id": 42,
    "name": "AP Calculus AB",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "MATH",
    "description": "AP Calculus AB is roughly equivalent to a first semester college calculus (Calc I) course devoted to topics in differential and integral calculus. The AP course covers topics in these areas, including concepts and skills of limits, derivatives, definite integrals, and the Fundamental Theorem of Calculus. The course teaches students to approach calculus concepts and problems when they are represented graphically, numerically, analytically, and verbally, and to make connections amongst these representations. Students learn how to use technology to help solve problems, experiment, interpret results, and support conclusions. At the end of the course it is expected that the student takes and passes the respective Advanced Placement examination. \\n Course Objectives \\n Students should be able to work with functions represented in a variety of ways: graphical, numerical, analytic, or verbal. They should understand the connections among these representations. \\n Students should understand the meaning of the derivative in terms of a rate of change and local linear approximation, and should be able to use derivatives to solve a variety of problems. \\n Students should understand the meaning of the definite integral both as a limit of Riemann sums and as the net accumulation of change, and should be able to use integrals to solve a variety of problems. \\n Students should understand the relationship between the derivative and the definite integral as expressed in both parts of the Fundamental Theorem of Calculus. \\n Students should be able to communicate mathematics and explain solutions to problems both verbally and in written sentences. \\n Students should be able to model a written description of a physical situation with a function, a differential equation, or an integral. \\n Students should be able to use technology to help solve problems, experiment, interpret results, and support conclusions. \\n Students should be able to determine the reasonableness of solutions, including sign, size, relative accuracy, and units of measurement. \\n Students should develop an appreciation of calculus.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MCS21XAB"]
  },
  {
    "id": 43,
    "name": "AP Calculus BC",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "MATH",
    "description": "AP Calculus BC is roughly equivalent to both first and second semester college calculus courses (Calc I and II) and extends the content learned in AB to different types of equations and introduces the topic of sequences and series. This course covers topics in differential and integral calculus, including concepts and skills of limits, derivatives, definite integrals, the Fundamental Theorem of Calculus, and series. You will learn how to approach calculus concepts and problems when they are represented graphically, numerically, analytically, and verbally, and to make connections amongst these representations. You will also learn how to use technology to help solve problems, experiment, interpret results, and support conclusions. At the end of the course it is expected that the student takes and passes the respective Advanced Placement examination. \\n Course Objectives \\n Students should be able to work with functions represented in a variety of ways: graphical, numerical, analytic, or verbal. They should understand the connections among these representations. \\n Students should understand the meaning of the derivative in terms of a rate of change and local linear approximation, and should be able to use derivatives to solve a variety of problems. \\n Students should understand the meaning of the definite integral both as a limit of Riemann sums and as the net accumulation of change, and should be able to use integrals to solve a variety of problems. \\n Students should understand the relationship between the derivative and the definite integral as expressed in both parts of the Fundamental Theorem of Calculus. \\n Students should be able to communicate mathematics and explain solutions to problems both verbally and in written sentences. \\n Students should be able to model a written description of a physical situation with a function, a differential equation, or an integral. \\n Students should be able to use technology to help solve problems, experiment, interpret results, and support conclusions. \\n Students should be able to determine the reasonableness of solutions, including sign, size, relative accuracy, and units of measurement. \\n Students should develop an appreciation of calculus.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": true,
    "prerequisites": [],
    "codes": ["MCS21XBC"]
  },
  {
    "id": 44,
    "name": "Algebra I",
    "freshman": true,
    "sophomore": false,
    "junior": false,
    "senior": false,
    "subject": "MATH",
    "description": " Algebra I is the first course offered in high school Mathematics. It is the responsibility of any incoming students to confirm that their middle school properly documented both taking Algebra I and the Regents Exam on their official transcript before the start of the school year. Students lacking the documentation, or those that did not take Algebra I in 8th grade will automatically be programmed for Algebra I. Algebra I provides tools and ways of thinking that are necessary for solving problems in a wide variety of disciplines, such as science, business, social sciences, fine arts, and technology. This course will assist students in developing skills and processes to be applied using a variety of techniques to successfully solve problems in a variety of settings. Problem situations may result in all types of linear equations in one variable, quadratic functions, exponential functions and operations using polynomials. Problem situations resulting in systems of equations will also be presented. Measurement within a problem-solving context will include calculating rates using appropriate units and converting within measurement systems. Data analysis including measures of central tendency and visual representations of data, in addition to an understanding of correlation and causation and regression equations will be explored. Students will solve problem situations requiring right triangle trigonometry. Students will sit for a NYS Regents Examination at the end of this course.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MES21H"]
  },
  {
    "id": 45,
    "name": "Geometry",
    "freshman": true,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "MATH",
    "description": "Geometry is intended to be the second course in mathematics for high school students. Within this course, students will have the opportunity to make conjectures about geometric situations and prove in a variety of ways, both formal and informal, that their conclusion follows logically from their hypothesis. This course is meant to employ an integrated approach to the study of geometric relationships. Integrating synthetic, transformational, and coordinate approaches to geometry, students will justify geometric relationships and properties of geometric figures.  Congruence and similarity of triangles will be established using  appropriate theorems. Transformations including rotations, reflections, translations, and glide reflections and coordinate geometry will be used to establish and verify geometric relationships. A major emphasis of this course is to allow students to investigate geometric situations. Properties of triangles, quadrilaterals, and circles should receive particular attention. It is intended that students will use the traditional tools of compass and straightedge as well as dynamic geometry software that models these tools more efficiently and accurately, to assist in these investigations. Geometry is meant to lead students to an understanding that reasoning and proof are  fundamental aspects of mathematics and something that sets it apart from the other sciences. Students will sit for a NYS Regents Examination at the end of this course.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MGS21H"]
  },
  {
    "id": 46,
    "name": "Career & Financ Mgmt",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "MATH",
    "description": "The Career and Financial Management Course is given as a dual initiative through the University of Iowa BizInnovator program and STEM Innovator Program, which is the entrepreneurship curriculum toolkit that enables educators to teach the 'entrepreneurial mindset' by encouraging creativity, innovation, critical thinking, and problem-solving - and also equipping students with the skills necessary to succeed and excel.  Students earn 3 college credits from the University of Iowa after completing this course.  This program blends the traditional topics covered in Career Financial Mgmt & Entrepreneurship curriculum to learn about the features of our economy, explore a variety of careers, learn the skills and competencies needed for success in the workplace and to begin to become financially literate, through a myriad of tasks and activities which invoke real-world finance and economic scenarios involved in achieving solutions.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MKS21T"]
  },
  {
    "id": 47,
    "name": "AP Precalculus",
    "freshman": true,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "MATH",
    "description": "",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MPS21X"]
  },
  {
    "id": 48,
    "name": "Math Team A",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "MATH",
    "description": "The Math Team is a place where all students who enjoy math come together. Students discuss and learn various areas of math, from elementary to very advanced, college level mathematics. Every meeting is filled with rich topics for discussion in various areas of mathematics. Topics will range from history, philosophy, and math education to the discussion and study of particular areas of math. Students problem solve for both remedial and advanced areas of mathematics. Problem solving sessions can range from subjects like high school algebra and geometry to college level courses such as calculus, statistics, analysis, abstract algebra, and much more. Some of the subjects covered in the Math Team are: Abstract Algebra, Real Analysis, Complex Analysis, Number Theory, Topology, Combinatorics, Probability, Linear Algebra, Differential Equations, Advanced Euclidean Geometry, Mathematics Education. The Math Team is also a great opportunity to meet other fellow math enthusiasts, and to make friends, to socialize and to have fun. Math Team is an elective course and meets 4-5 times a week during the school day. The Team participates in New York City Interscholastic Math League(NYCIML), the New York Mathematics League(NYML), American Mathematics Competitions (AMC 10/12), Purple Comet and TrinMac.  The school also competes in the Downtown Mathematics Invitational at Stuyvesant HS, South Brooklyn Invitational Mathematics Competition at FDR HS and the Staten Island Mathematics Competition at SITHS.  We also organize and run District 31’s Elementary and Middle School Math Competitions.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MQS11QTA"]
  },
  {
    "id": 49,
    "name": "Math Team B",
    "freshman": true,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "MATH",
    "description": "The Math Team is a place where all students who enjoy math come together. Students discuss and learn various areas of math, from elementary to very advanced, college level mathematics. Every meeting is filled with rich topics for discussion in various areas of mathematics. Topics will range from history, philosophy, and math education to the discussion and study of particular areas of math. Students problem solve for both remedial and advanced areas of mathematics. Problem solving sessions can range from subjects like high school algebra and geometry to college level courses such as calculus, statistics, analysis, abstract algebra, and much more. Some of the subjects covered in the Math Team are: Abstract Algebra, Real Analysis, Complex Analysis, Number Theory, Topology, Combinatorics, Probability, Linear Algebra, Differential Equations, Advanced Euclidean Geometry, Mathematics Education. The Math Team is also a great opportunity to meet other fellow math enthusiasts, and to make friends, to socialize and to have fun. Math Team is an elective course and meets 4-5 times a week during the school day. The Team participates in New York City Interscholastic Math League(NYCIML), the New York Mathematics League(NYML), American Mathematics Competitions (AMC 10/12), Purple Comet and TrinMac.  The school also competes in the Downtown Mathematics Invitational at Stuyvesant HS, South Brooklyn Invitational Mathematics Competition at FDR HS and the Staten Island Mathematics Competition at SITHS.  We also organize and run District 31’s Elementary and Middle School Math Competitions.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MQS11QTB"]
  },
  {
    "id": 50,
    "name": "Linear Algebra - CSI 2778",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "MATH",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MQS11UCN"]
  },
  {
    "id": 51,
    "name": "Algebra II",
    "freshman": true,
    "sophomore": true,
    "junior": true,
    "senior": false,
    "subject": "MATH",
    "description": "Algebra II is the capstone in the three units of credit required for a Regents diploma. This course is a continuation and extension of the two courses that preceded it. This course is intended to continue developing alternative solution strategies and algorithms. For example, technology can provide to many students the means to address a problem situation to which they might not otherwise have access. Within this course, the number system will be extended to include imaginary and complex numbers. The families of functions to be studied will include polynomial, absolute value, radical, trigonometric, exponential, and logarithmic functions. Problems resulting in systems of equations will be solved graphically and algebraically including 3 variable systems. Algebraic techniques will be developed to facilitate rewriting mathematical expressions into multiple equivalent forms. Data analysis will be extended to include measures of dispersion and the analysis of regression that models functions are studied throughout this course. Arithmetic and geometric sequences will be expressed in multiple forms, and arithmetic and geometric series will be evaluated. Right triangle trigonometry will be expanded to include the investigation of circular functions and analysis of all trigonometric graphs. Students will sit for a NYS Regents Examination at the end of this course.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MRS21H"]
  },
  {
    "id": 52,
    "name": "AP Statistics",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "MATH",
    "description": "",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["MSS21X"]
  },
  {
    "id": 53,
    "name": "PE Dance",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "This class is designed to enhance your love and appreciation of dance through movement. Dance routines span a multitude of genres including but not limited to jazz, hip hop, multicultural, and lyrical dance",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PDS72QD"]
  },
  {
    "id": 54,
    "name": "PE 2 Dance",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PDS74QD"]
  },
  {
    "id": 55,
    "name": "PE 3 Dance",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PDS76QD"]
  },
  {
    "id": 56,
    "name": "PE Fitness",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "This course emphasizes the basics of yoga, meditation and other cardiovascular fitness including the use of freeweights and an individual’s bodyweight. Students will build endurance and reflect on their own fitness plan.",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PFS72QF"]
  },
  {
    "id": 57,
    "name": "PE 2 Fitness",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PFS74QF"]
  },
  {
    "id": 58,
    "name": "PE 3 Fitness",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PFS76QF"]
  },
  {
    "id": 59,
    "name": "PE Weight Training",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "This is an introductory course designed to help each student improve muscular strength, understand weight training theory and practice, and develop a personalized weight training program.",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PGS72QW"]
  },
  {
    "id": 60,
    "name": "PE 2 Weight Training",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PGS74QW"]
  },
  {
    "id": 61,
    "name": "PE 3 Weight Training",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PGS76QW"]
  },
  {
    "id": 62,
    "name": "Health Education",
    "freshman": true,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PHS11"]
  },
  {
    "id": 63,
    "name": "PE",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "Physical Education class is a traditional PE class that encourages physical activity through various team sports such as soccer, football, basketball, volleyball, softball, tennis and other team oriented ball sports.   Throughout each of the disciplines,  each sport’s rules and practices are covered. Students are required to work in groups that encourage the principles of teamwork, compassion, encouragement and perseverance. Freshman physical education class is conducted as an introduction into high school physical education and the key components of sportsmanship and fitness in an effort to ignite a lifelong love of being physically fit.",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PPS71", "PPS72"]
  },
  {
    "id": 64,
    "name": "PE 2",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PPS74"]
  },
  {
    "id": 65,
    "name": "PE 3",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PPS76"]
  },
  {
    "id": 66,
    "name": "PE Basketball",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "Students have the ability to apply for basketball physical education.  This class is for students who wish to concentrate their physical fitness experience in the fast moving sport of basketball.  This class will cover the rules, as well as the fundamental and intermediate skills of the game.",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PQS72QBB"]
  },
  {
    "id": 67,
    "name": "PE Marching Band",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "for students who already are and active part of the school’s music program.  This class performs at various off-site festivals, competitions, parades, halftimes of PSAL games and other community functions.  Additional rehearsals are a requirement for this course.",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PQS72QMB"]
  },
  {
    "id": 68,
    "name": "PE 2 Basketball",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PQS74QBB"]
  },
  {
    "id": 69,
    "name": "PE 2 Marching Band",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PQS74QMB"]
  },
  {
    "id": 70,
    "name": "PE 3 Basketball",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PQS76QBB"]
  },
  {
    "id": 71,
    "name": "PE 3 Marching Band",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PQS76QMB"]
  },
  {
    "id": 72,
    "name": "PE Badminton",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "for students who want to improve their overall badminton skills and learn the strategies and positions related to badminton.",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS72QB"]
  },
  {
    "id": 73,
    "name": "PE Table Tennis",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS72QTT"]
  },
  {
    "id": 74,
    "name": "PE Volleyball",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "for students who want to improve their overall volleyball skills and learn the strategies and positions related to volleyball.",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS72QV"]
  },
  {
    "id": 75,
    "name": "PE Adv Volleyball",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "for students with above average volleyball skills oand the desire to learn advance strategies in the game of volleyball.  Registration for this course requires completing the basic Volleyball course or the recommendation of your physical education teacher.",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS72QVA"]
  },
  {
    "id": 76,
    "name": "PE 2 Badminton",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS74QB"]
  },
  {
    "id": 77,
    "name": "PE 2 Table Tennis",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS74QTT"]
  },
  {
    "id": 78,
    "name": "PE 2 Volleyball",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS74QV"]
  },
  {
    "id": 79,
    "name": "PE 2 Adv Volleyball",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS74QVA"]
  },
  {
    "id": 80,
    "name": "PE 3 Badminton",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS76QB"]
  },
  {
    "id": 81,
    "name": "PE 3 Table Tennis",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS76QTT"]
  },
  {
    "id": 82,
    "name": "PE 3 Volleyball",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS76QV"]
  },
  {
    "id": 83,
    "name": "PE 3 Adv Volleyball",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PRS76QVA"]
  },
  {
    "id": 84,
    "name": "PE Team PE",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "PE",
    "description": "Team physical education is designed for upperclassmen who are actively participating on a PSAL sports team from September through June.  Student athletes may apply for the class with a recommendation from their PSAL coach.   ",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PTS72QT"]
  },
  {
    "id": 85,
    "name": "PE 2 Team PE",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PTS74QT"]
  },
  {
    "id": 86,
    "name": "PE 3 Team PE",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "PE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["PTS76QT"]
  },
  {
    "id": 87,
    "name": "Intro Tech Careers",
    "freshman": true,
    "sophomore": false,
    "junior": false,
    "senior": false,
    "subject": "CAREER",
    "description": "The goal of this course is to provide you with the technical ability, knowledge, and skills necessary to succeed in your future endeavors and prepare you for college and career readiness.  We are committed to providing you with a unique experience while at Staten Island Tech, supporting each of you as you work towards building the 21st century skills needed to stand apart in this competitive market.  In order to achieve this, the Introduction to Talknology and Career and Technical Education Lab course is focused on applying a high tech, low tech, and no tech exploration of: \\n Acquiring and accurately using protocols for effective communication in oral, written, and multimedia/digital formats \\n Examining multiple sources of career information from diverse formats to make informed career decisions and manage personal career plans \\n Analyzing existing and emerging computer technologies to research and explore the global impacts to industry and the comprehensive job market \\n Developing the key ‘soft skills’ needed for workplace success \\n Understanding how an individual's digital media presence is used by potential employers and post-secondary agencies to evaluate candidates. \\n Exploring work-based learning opportunities to demonstrate and expand upon knowledge and skills gained during classroom instruction. \\n Students will develop the skills needed to transition from the classroom to the workplace; these competencies include core academic and technical knowledge, employability skills, and job specific training. \\n The skills learned in this class can be applied broadly as you progress throughout both your educational and professional caree \\n This course will also encourage collaboration and teamwork with your peers and with your growing network, promoting the inclusion of divergent and creative perspectives.  An emphasis will be placed throughout the entire course on the 21st century learning skills and relevance of a concept called Oracy.  Oracy is a recently developed curriculum designed to provide students with the opportunity to learn effective communication techniques - verbal, non-verbal, and written - that can be applied as they progress throughout their educational and professional careers. The purpose of this new course will be to prepare students for social interactions, workplace readiness, and life. Using the tools developed by School 21 in England, and through the incorporation of Work Based Learning practices and the HOPE Skills, students are given the chance to develop the necessary soft skills and speaking skills necessary for success in any industry.  Through use of the Oracy toolkit and talk protocols, students will “learn to talk” and “talk to learn.”",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["RZS21TF"]
  },
  {
    "id": 88,
    "name": "Work Based Learning",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "CAREER",
    "description": "The SITHS Career Development Center “CDC” has established multiple partnerships and funding sources to offer employment and paid or unpaid internship opportunities to hundreds of SITHS students.  This internship course is an elective class which can be taken multiple times throughout your high school career.  It is designed so that students can leave school early to accommodate the needs of the position.  The job must meet eligibility requirements. This “offsite” course will combine a number of in-class meetings with the hours worked in the internship to satisfy the course total requirements that all students must have.  \\n The Work-Based Learning Internship course meets in school, usually once a week, during 9th period.  \\n The rest of the week, you will have period 9 free to work your Work-Based Learning/Internship opportunity. \\n If you register for this course, you are expected to secure an internship or experience that is in alignment with NYC Department of Education regulations and NYS Labor Laws.  The specifics of this will be elaborated in the class.\\n Both paid and unpaid experiences can be eligible. \\n Paid experiences can originate with SITHS CDC funding sources, or with external businesses or programs that fund your position, such as through our school’s partnership with DYCD and Grant Associates.  \\n Unpaid experiences, such as certain special programs like ACE Mentorship, can be eligible. \\n All work-based learning experiences must be approved by the Work Based Learning Coordinator and the Career Development Center. \\n The in-class portion of the course will instruct and challenge students on refining their professional skills and prepare them to work with SITHS business partners and local businesses throughout New York City.  This course will support students as they understand the resources needed for finding a job, explore career paths that align with their interests and strengths, and support them with professional development while working in an internship. \\n Students who are interested in the architecture/engineering fields have a higher percentage opportunity of obtaining a paid internship (sponsored by the SITHS CDC) with Designer’s Edge, a nationally recognized architecture survey firm.  Students who are interested in the A/V engineering field also have a higher percentage opportunity to work with Gotham Trinity Productions, a film and media production company. \\n Students who have questions about this unique course option should come to the SITHS Career Development Center in room 229 for further information. ",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["RZS21TY"]
  },
  {
    "id": 89,
    "name": "Biology",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "SCIENCE",
    "description": "N/A",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SBS21H"]
  },
  {
    "id": 90,
    "name": "AP Biology",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "AP Biology is a college level two semester introductory course in general biology. Most students who enroll in the equivalent of this course in college are usually interested in further study of biology or medicine. There is less emphasis on breadth of content coverage and more emphasis on in-depth conceptual understanding and science practices. As a result, this course requires students to spend more time on inquiry based learning of concepts and development of scientific reasoning skills such as formulating a scientific argument, analyzing case studies, designing a plan for collecting data, analyzing data, applying statistical tests, and connecting concepts across disciplines. SITHS’s goal is to engage students in learning biology so that this course becomes a positive component of their high school experience, that not only prepares them for more advanced study in biology (if they choose to pursue that) but also enriches their life.  Because we emphasize USING facts about biology rather than memorizing information, SITHS hopes the teaching methods  used will significantly change the way students view the world.  Sometimes students will practice applying the material alone, and sometimes students will do so with members of their learning team.  SITHS wants to foster an interest in biology that continues beyond the date of the final exam, prepares students to make effective choices in the voting booth, enables students to be citizens of the world, and helps them acquire skills that can be used in other endeavors.  The sequence of topics is as follows: scientific inquiry, ecology and plant biology, biochemistry, energy and cells, genetics, evolution, and human anatomy and physiology. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SBS21X"]
  },
  {
    "id": 91,
    "name": "Chemistry",
    "freshman": true,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "SCIENCE",
    "description": "The Physical Setting/Chemistry course is designed to introduce the student to a wide range of chemical applications.  The main focus is on basic and fundamental principles of Chemistry.  At the completion of the course, students should have a working knowledge of the basic principles of Chemistry.  Included in the topics covered will be the chapters on matter and energy, atomic structure, chemical bonding, the periodic table, stoichiometry, kinetics and equilibrium, acids and bases, redox and electrochemistry, nuclear chemistry and organic chemistry.  The course will begin with a basic definition of chemistry and builds upon each new principle.  Due to the nature of scientific learning, each unit throughout the semester will build upon previous units and covered material.  There are five lecture periods each week plus a chemistry lab that meets once a week.  At the end of the course, it is expected that the student takes and passes the regents examination.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SCS21H"]
  },
  {
    "id": 92,
    "name": "AP Chemistry",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "The AP Chemistry course provides students with a college-level foundation to support future advanced coursework in chemistry. Students cultivate their understanding of chemistry through inquiry-based laboratory investigations and classwork, as they explore topics such as: atomic structure, intermolecular forces and bonding, chemical reactions, kinetics, thermodynamics, and equilibrium.  The course curriculum is compatible with Chemistry courses in colleges and universities. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SCS21X"]
  },
  {
    "id": 93,
    "name": "Applied Physics",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "This is a second-year high school physics course designed to give students an alternative to the AP Physics classes in Junior and Senior year. This course is a 1-year course that will explore and apply more advanced topics in physics in a hands-on approach to learning, where students will take part in a number of design projects throughout the year.  You will be presented with tasks related to topics in physics that build upon the Regents course by researching, designing, building and analyzing data to creatively problem solve. Since this is a second-year physics course and can only be taken by juniors and seniors you will also be utilizing Autodesk products such as CAD, Inventor and Fusion to help you with your designs. You will need to work collaboratively to complete these tasks and your interpersonal skills will be put to the test.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SDS21H"]
  },
  {
    "id": 94,
    "name": "AP Environ Sci",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "This challenging course will take a global perspective to explore the status of sustainable Planet Earth. Students will examine environmental science through labs, field work, case studies, and discussion.  As global citizens, students will investigate the practices and services in local, regional, national, and global spaces.  First, students will investigate water use followed up with local water testing to explore the overall health of Staten Island’s waterways.  Over the next few units, students will investigate the landscape and its biodiversity, discussing how biomes are changing and their impact on various species, including humans.  This leads to an understanding of human population growth and its impacts on the environment, demonstrating the elasticity of the earth as well as its limitations.  After identifying the consequences of our growth rate, students will determine our energy use and prioritize our energy resources in terms of economic and environmental factors.  This segues into climate change – what it is, why it’s happening, its effects, and what we can do.  The course will culminate in a final unit of sustainable cities, where students will discuss and create their own sustainable community based on the information gathered throughout the year.  By the end of the year, each student should take away a concrete understanding of the various footprints on our planet and a plan on how to minimize it. At the end of the course,it is expected that the student takes and passes the respective Advanced Placement examination.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SES21X"]
  },
  {
    "id": 95,
    "name": "Forensic Science - Col St Rose 2091",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SFS21U"]
  },
  {
    "id": 96,
    "name": "Comp Sci/Engineering",
    "freshman": true,
    "sophomore": false,
    "junior": false,
    "senior": false,
    "subject": "SCIENCE",
    "description": "Freshman will have the option to take the fundamentals of computer science through an introduction to programming in Python. This course provides an introduction to programming and the Python language. Students are introduced to core programming concepts like data structures, conditionals, loops, variables, and functions. This course includes an overview of the various tools available for writing and running Python and gets students coding quickly. It also provides hands-on coding exercises using commonly used data structures, writing custom functions, and reading and writing to files. This course will also introduce topics in web development using HTML, CSS and Flask.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SKS21T"]
  },
  {
    "id": 97,
    "name": "Physics",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "Honor's Regents Physics is a one-year course designed to provide a general understanding of the fundamental principles of physics and, at the same time, to achieve a deeper understanding of these principles. The syllabus includes five core units: Mechanics, Energy, Electricity and Magnetism, Wave Phenomena, and Modern Physics. Additional topics include Motion in a Plane, Internal Energy, Geometric Optics, and Nuclear Energy. There are five lecture periods each week plus a physics lab that meets once a week.  At the end of the course, it is expected that the student takes and passes the regents examination. For additional information please refer to the NYS Physics Core Curriculum which can be found here: http://www.p12.nysed.gov/ciai/mst/pub/phycoresci.pdf",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SPS21H"]
  },
  {
    "id": 98,
    "name": "Physics in Medicine",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "SCIENCE",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SPS21HM"]
  },
  {
    "id": 99,
    "name": "AP Physics 1",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "AP Physics 1 is an algebra-based, introductory college-level physics course that explores topics such as Newtonian mechanics (including rotational motion); work, energy, and power; mechanical waves and sound; and introductory, simple circuits. Through inquiry- based learning, students will develop scientific critical thinking and reasoning  skills. This course requires that 25 percent of the instructional time will be spent in hands-on laboratory work, with an emphasis on inquiry- based investigations that provide students with opportunities to apply the science practices. No prior coursework in physics is necessary. Students should have completed geometry and be concurrently taking Algebra II or an equivalent course. Although the Physics 1 course includes basic use of trigonometric functions, this understanding can be gained either in the concurrent math course or in the AP Physics 1 course itself. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SPS21X1"]
  },
  {
    "id": 100,
    "name": "AP Physics 2",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "AP Physics 2 is an algebra-based, introductory course.  Students cultivate their understanding of Physics through inquiry-based investigations as they explore these topics:  fluids; thermodynamics; electrical force, field and potential; electric circuits; magnetism and electromagnetic induction; geometric and physical optics; and quantum, atomic and nuclear physics. AP Physics 2 is a full-year course that is the equivalent of a second-semester introductory college course in algebra-based physics. Prerequisite classes are either Regents Physics or AP Physics 1. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SPS21X2"]
  },
  {
    "id": 101,
    "name": "AP Physics C Electricity and Magnetism T",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "SCIENCE",
    "description": "",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SPS21XC"]
  },
  {
    "id": 102,
    "name": "Issues in Science - Kingsboro 2358",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SQS11UCN"]
  },
  {
    "id": 103,
    "name": "Sci Eng Research",
    "freshman": false,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "SCIENCE",
    "description": "The SERP courses are designed to train students to conduct scientific research and compose a scientific research paper, with the ultimate goal to compete in city, state, and nationwide science fairs.  This course encourages and enables students to think critically, ask questions, conduct research, determine outcomes using the scientific method, and express this information in a cogent, scientific manner. The course will consist of diverse activities meant to challenge students, enhance their problem solving capabilities, and improve  written and verbal communication skills. All of this will enable students to conduct effective, solid research projects.  Students enrolled in SERP are given opportunities to perform original research alongside nationally recognized leading scientists and mentors.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SQS61TJ"]
  },
  {
    "id": 104,
    "name": "Adv Sci Eng Res 2",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "SCIENCE",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SQS63TJ"]
  },
  {
    "id": 105,
    "name": "Adv Sci Eng Res 3",
    "freshman": false,
    "sophomore": false,
    "junior": false,
    "senior": true,
    "subject": "SCIENCE",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SQS65TJ"]
  },
  {
    "id": 106,
    "name": "Anatomy & Physiology",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "This course is designed to be a study of the human body for students with an interest in pursuing a career in a health-related field. Topics include anatomical structures, physiological systems, and body functions. Students will apply the principles of physiology to human health and evaluate the applications and career implications of physiology and anatomy principles",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SWS21HA"]
  },
  {
    "id": 107,
    "name": "Biotechnology - Col St Rose 2091",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SWS21UB"]
  },
  {
    "id": 108,
    "name": "AP Psychology",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "SCIENCE",
    "description": " AP Psychology is the study of behavior and mental processes. The course is the equivalent of a college level introductory course in Psychology.  Usually, the college class is taken over the course of one semester.  For students intent on pursuing a major in psychology or neuroscience, this is a required course.  For other students, the completion of this course and success on the AP Psychology Examination may serve to fulfill a social science core requirement mandated by select colleges and universities.  This course is designed to help students develop invaluable skills that include the ability to present information logically via discussions and written papers as well as to carry out proper research techniques.  Psychology also fosters the development of critical thinking and problem solving skills. Psychology is a discipline that is driven by terminology.  It is not enough for students to be able to  define the terms;they must be able to apply them to real life situations.  As such, a  large part of the course is designed to focus on different case studies which allow for such application.  The course also includes some lab work as well classroom demonstrations and computer simulations.  The sequence of topics is as follows:  Research Methods and Statistics, Neuropsychology, Sensation, Perception and States of Consciousness, Learning, Cognition, Developmental Psychology, Personality, Abnormal Psychology, Social Psychology, Motivation, Emotion and Health Psychology. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["SWS21XPS"]
  },
  {
    "id": 109,
    "name": "Engineering Robotics",
    "freshman": true,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "TECH",
    "description": "Introduction to STEM - Engineering and Robotics (STEM) is a mandatory half-year freshman level course that introduces various applications of the math and science concepts encountered in secondary education.  The major focus is to expose students to various engineering fields, the design process, research and analysis, teamwork, communication methods, engineering standards, and technical documentation. Students will develop skills and understanding of course concepts through activity, project, and problem-based (APPB) learning. Used in combination with a teaming approach, APPB-learning challenges students to continually hone their interpersonal skills, creative abilities, practical execution, and understanding of the design process.  It also allows students to develop strategies to enable and direct their own learning, which is the ultimate goal of education.\\n Beginning with an overview of the ABET approved engineering disciplines, students will learn and apply the design process through basic problems and applications of Mechanical, Materials, Civil/Architectural, and Computer/Electrical Engineering.  In addition to basic building and programming using the Tetrix robotics and Arduino platforms, students can expect to encounter structural member properties, bridge/tower/cantilever prototyping and testing, computer aided drafting, 3D modeling, technical documentation, and DIY design prototyping, spanning the core engineering disciplines.  At various points in the course, students will be required to manage multiple unrelated projects at once, requiring the critical development of efficient group dynamics and proper execution of time management.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["TMS11T"]
  },
  {
    "id": 110,
    "name": "Intro Comp Game Prgram - CSI 2778",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "TECH",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["TQS11UCN"]
  },
  {
    "id": 111,
    "name": "Advanced Engineering",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "TECH",
    "description": "N/A",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["TQS21T"]
  },
  {
    "id": 112,
    "name": "Adv Comp App/Dev",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "TECH",
    "description": "There are two versions of the course that you can choose from. \\n Web Development:  Students will develop, maintain and document full-stack applications that target school and community needs. Students will work as part of an organization that mirrors real world development work environments to develop applications that have real world impact. Students are required to have completed AP CSP and can speak directly with Mr. Whalen regarding the types of applications currently in development \\n Cloud Computing & Cybersecurity:Students will have the opportunity to take part in a cloud computing and ethical hacking course that will offer the opportunity to develop and apply the skills below to the projects listed.  \\n 1. Advanced Python – Students will be taking their fundamental knowledge of python much deeper to work with other programs and systems that will support the cloud and ethical hacking.  This will help integrate neural networks, as well as create a platform for AI, machine learning and data science.\\n 2. Linux Bash Scripting – Since Linux will be the operating of working with Raspberry Pi’s, understanding how to script in the Linux will allow students to better interact with these devices. \\n 3. Virtualization – Since we can run numerous virtual images on Raspberry Pi’s, understanding how virtualization works will allow students to create numerous virtual PC’s to run in cloud instances, which will give them their own private cloud for each virtual machine running.  We will also be running Kali Linux in VMware to conduct all ethical hacking projects. \\n 4. Windows Powershell Scripting – Some of these virtual images will be running Windows for projects we want to do.  Understanding how to run and script in Windows Powershell will allow students to automate tasks and processes that will make their cloud computing more seamless and efficient.  \\n 5. Networking and Security – With a solid foundation of connecting devices on and across networks, students will be able to access their private cloud from anywhere in the world, as well as make it accessible to anyone they give permission to.  Baked into this section will be the security needed to secure their devices and virtual images on the network from breaches and unauthorized access. \\n Cloud Computing Projects – \\n For these projects to happen, students will need to have the basic understanding of the Python scripting that goes into the setup for this.  Understanding Linux and Bash scripting to initially setup the Raspberry PI and allow for virtual machines to run on them.  They will need to understand how to create and use virtual machines, which will host the operating system of their choice that will allow them to take on any of the above-mentioned projects. Using Python to set up their Raspberry Pi to be a server.  The purpose of creating a server from Raspberry Pi will be to have it act as a host.  Projects that will include the Raspberry Pi as a host will be:  NAS or file server, Web server, Online game server, Media streaming server, Home automation server, Print server, Personal cloud server \\n Ethical Hacking Projects - \\n Using basic network, python, and Linux skills, students will learn the fundamentals of ethical hacking. For these projects to happen, students will need a basic understanding of Python and Networking. Prior to jumping into these projects, students will learn basic networking and Linux skills to allow them to complete all ethical hacking projects. Projects that are grounded in ethical hacking will be:  Software Keylogger, Website and Email Spoofing, Brute Force Network Attacks, DNA Encryption Program, Pen testing and Packet Sniffing",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["TWS21T"]
  },
  {
    "id": 113,
    "name": "Intro to Computer Science - CSI 2778",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": false,
    "subject": "TECH",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["TYS11UCN"]
  },
  {
    "id": 114,
    "name": "Electronics/Green Tech",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "TECH",
    "description": "Electronics is a full year course offered at Staten Island Technical High School that will cover theoretical concepts of digital components and circuitry, and then reinforce it in the lab setting by using National Instruments “Multisim 11” software. Two Makerspace hands-on projects - designing and building Digital Clock/Timer and Portable Bluetooth Speaker are part of the electronics curriculum. \\n Students will gain core knowledge and applications of principles representative of the various fields of study within the Engineering industry including Green Technologies such as solar and wind power. The Electronics two-term curriculum will enable students to explore various aspects of circuit theory with direct and alternating current. This includes analysis of various types of circuits using passive and active components and is complemented with the use of virtual lab activities that reinforce what students learn. The second term curriculum builds on previous knowledge of circuit theory to explore the effects of components such as inductors, capacitors, filters, transistors, amplifiers etc. This leads into basic understanding of radio and amplifier circuits in communications. The use of National Instruments “Multisim 11” lab software activities enhances and reinforces this instruction. \\n The following topics will be covered: \\n Number Systems: Binary, Hex, and Octal. \\n Boolean Algebra – Algebraic, Standard, Canonical, and Karnaugh Forms of Boolean Functions. \\n Optimization of Boolean Functions. two through five variables functions simplification using K-Map Method. \\n Combinational Logic – (SSI – Small Scale Integration) – Gate Diagrams, Decision Making Digital Circuits. \\n Optimizing circuits for cost, speed, and size. \\n MSI (Medium Scale Integration) and PLD’s ( Programmable Logic Devices) \\n The following components will be covered: Adders, Multiplexers, ROM’s, Programmable Logic Arrays (PLA), and Programmable Array Logic (PAL). \\n Synchronous Sequential Logic (Memory Elements) – JK, D, T, and RS Flip-Flops.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["TYS21T"]
  },
  {
    "id": 115,
    "name": "AP Comp Sci Principles - Javascript",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "TECH",
    "description": "",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["TYS21X"]
  },
  {
    "id": 116,
    "name": "A/V Eng & TV Studio",
    "freshman": true,
    "sophomore": false,
    "junior": false,
    "senior": false,
    "subject": "TECH",
    "description": "Freshman will have the option to take Intro to Audio/Video Engineering & TV Studio, which enables students to learn the technical engineering aspects of operating the video and audio hardware and software used in both television studios and mobile-based multimedia productions within a multi-million dollar HD TV studio. Students will have an in-depth understanding of camera functionality, light-to-video conversion, microphone technologies, and video editing using Adobe Premiere.  This is achieved through a process of developing skills through individual and group-based activities and practical assessments, along with learning the skills and procedures necessary to operate mobile and studio based TV and recording equipment.  The skills learned in this course prepare students for future study and careers in A/V engineering, television production, and filmmaking.  However, these skills are also transferrable to practical applications in any courses/careers students will encounter, as our society continues to rely less on the printed word and more on a variety of audio-video media as our means of communication in the 21st century.   ",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["TZS11T"]
  },
  {
    "id": 117,
    "name": "Chamber Music",
    "freshman": true,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "Staten Island Technical High School has the following chamber music groups; Saxophone Ensemble (2), Brass Ensemble and Mixed Ensemble. Students perform throughout the school year.                                 Prerequisites: Audition only, instructor approval.",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["UCS11H"]
  },
  {
    "id": 118,
    "name": "Concert Band",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": false,
    "subject": "ARTS",
    "description": "Concert Band (Grade 10) - continues the track started in Freshmen Band, by applying note-reading skills, musicianship, rehearsal techniques to increasingly challenging literature. Students will improve basic musicianship skills through the practice and performance of concert works & exercises in a large ensemble setting as well as develop and improve proper playing technique. NYSSMA Level IV",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["UDS11HCB"]
  },
  {
    "id": 119,
    "name": "Freshmen Band",
    "freshman": true,
    "sophomore": true,
    "junior": false,
    "senior": false,
    "subject": "ARTS",
    "description": "Freshmen Band is for beginning students, as well as those who are getting down the basics for performing in a band setting. The Freshmen Band’s emphasis is on acquiring the fundamentals: posture, instrument knowledge, note-reading skills and rehearsal technique. Students will develop basic musicianship through the practice and performance of concert works & exercises in a large ensemble setting, develop and improve proper playing technique. NYSSMA Level III",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["UDS11HFB"]
  },
  {
    "id": 120,
    "name": "Symphonic Band",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": false,
    "subject": "ARTS",
    "description": "Symphonic Band (Grade 11/12) - continues the track started in Freshmen Band, by applying note-reading skills, musicianship, rehearsal techniques to increasingly challenging literature. Students will improve basic musicianship skills through the practice and performance of concert works & exercises in a large ensemble setting as well as develop and improve proper playing technique. NYSSMA Level IV            ",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["UDS11HPB"]
  },
  {
    "id": 121,
    "name": "Wind Ensemble",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "Wind Ensemble is the highest level band at Staten Island Technical High School. Students who have been promoted to this level demonstrate a high degree of proficiency on their chosen instrument. In this class, we explore deeper listening, precision of execution, phrasing, balance and blend and interpretive style. Chamber Winds focuses on performing advanced high school and early college level works of significant length and artistic depth. NYSSMA Level VI.                   Prerequisites: Audition only, instructor approval.            ",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["UDS11HWE"]
  },
  {
    "id": 122,
    "name": "Jazz Ensemble",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "This premier performing group placing strong emphasis on advanced high school and collegiate repertoire requiring jazz improvisation from all selected musicians.  The musicians enjoy performances throughout the school year, including participation in the Essentially Ellington jazz festivals and NYSSMA Level VI.                       Prerequisites: Audition only, instructor approval.            ",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["UJS11H"]
  },
  {
    "id": 123,
    "name": "Orchestration & Conducting",
    "freshman": false,
    "sophomore": false,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "",
    "ap": false,
    "honors": true,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": ["UUS11H"]
  },
  {
    "id": 124,
    "name": "Band",
    "freshman": true,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "ARTS",
    "description": "",
    "ap": false,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": []
  },
  {
    "id": 125,
    "name": "AP Comp Sci Principles - Python",
    "freshman": false,
    "sophomore": true,
    "junior": true,
    "senior": true,
    "subject": "TECH",
    "description": "",
    "ap": true,
    "honors": false,
    "mandatoryCourse": false,
    "doublePeriod": false,
    "prerequisites": [],
    "codes": []
  }
]
